In [2]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

df = pd.read_csv('C:/Users/ab20acw/Desktop/CarBuyers.csv')
print(df)

     Manufacturer     Model       Price  Transmission       Power  \
0            Ford     Focus   30.619322      5.966102   94.033898
1            Ford    Fiesta   18.532143      5.714286   68.571429
2      Volkswagen      Golf   31.242154      6.164835   89.461538
3         Renault      Clio   22.100000      5.615385   75.576923
4             BMW      320i   47.848370      6.444444  126.111111
...           ...       ...         ...           ...         ...
6087   Land-Rover  Defender  108.747195      7.853659  207.609756
6088       Toyota      RAV4   43.548516      1.354839  137.774193
6089   Alfa-Romeo    Spider   55.200000      6.000000  163.500000
6090        Honda   Shuttle   30.081000      4.000000  110.000000
6091   Mitsubishi     Space   23.165158      3.947368   82.157895

        Engine CC    Fuel    Male  Female Unknown    Total
0     1497.169492  petrol  814172  422731  56,487  1293390
1     1166.142857  petrol  554879  631666  54,057  1240602
2     1537.406593  petrol  483216  310604  47,563   841383
3     1219.653846  petrol  241287  312556  28,004   581847
4     1995.777778  petrol  408016  115843  29,125   552984
...           ...     ...     ...     ...     ...      ...
6087  2304.975610  diesel   1,012     150      80    1,242
6088  2261.193548  petrol     670     482      66    1,218
6089  2696.500000  petrol     790     247      81    1,118
6090  2254.000000  petrol     639     416      49    1,104
6091  1817.315789  petrol     721     251      40    1,012

[6092 rows x 11 columns]

In [3]:
ndf = df[['Manufacturer','Male', 'Female']].copy()
ndf.head()

  Manufacturer    Male  Female
0         Ford  814172  422731
1         Ford  554879  631666
2   Volkswagen  483216  310604
3      Renault  241287  312556
4          BMW  408016  115843

In [19]:
boi1 = ['Honda']
boi2 = ['Mercedes']
#brands of interest, we will be looking into honda and mercedes
jdf = ndf.loc[ndf['Manufacturer'].isin(boi1)]
gdf = ndf.loc[ndf['Manufacturer'].isin(boi2)]
jdf.head()

    Manufacturer    Male  Female
9          Honda  242188  132958
16         Honda  105551  136875
51         Honda  74,157  15,889
196        Honda   7,167   5,292
211        Honda   6,436   4,377

In [20]:
gdf.head()

   Manufacturer    Male  Female
13     Mercedes  209476  69,373
28     Mercedes  125070  24,029
36     Mercedes  55,510  68,928
79     Mercedes  38,415  16,438
86     Mercedes  24,741  25,424

In [23]:
import matplotlib.pyplot as plt